app/services/csv_import_service.rb

INSERT INTO "users" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["first_name", "John"], ["last_name", "Doe"], ["created_at", "2024-01-25 16:14:18.052827"], ["updated_at", "2024-01-25 16:14:18.052827"]]
INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Marketing"], ["created_at", "2024-01-25 16:33:58.487523"], ["updated_at", "2024-01-25 16:33:58.487523"]]
SELECT "groups".* FROM "groups" WHERE "groups"."name" = ? LIMIT ?  [["name", "Marketing"], ["LIMIT", 1]]
INSERT INTO "user_group_associations" ("user_id", "group_id", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 11], ["group_id", 1], ["role", "Organizer"], ["created_at", "2024-01-25 16:14:18.062846"], ["updated_at", "2024-01-25 16:14:18.062846"]]
SELECT "user_group_associations".* FROM "user_group_associations" WHERE "user_group_associations"."user_id" = ? AND "user_group_associations"."group_id" = ? AND "user_group_associations"."role" = ? LIMIT ?  [["user_id", 11], ["group_id", 1], ["role", "Organizer"], ["LIMIT", 1]]
---
  def import_users
    CSV.foreach(@file_path, headers: true) do |row|
      user = User.create(first_name: row['First Name'], last_name: row['Last Name'])
      group = Group.find_or_create_by(name: row['Group Name'])
      role = row['Role']

      if user && group && UserGroupAssociation.roles.key?(role.downcase)
        UserGroupAssociation.find_or_create_by(user:, group:, role: role.downcase)