app/views/groups/edit.html.erb

  <%= form_with(model: UserGroupAssociation.new, url: add_user_to_group_group_path(@group), method: :post, local: true, class: 'd-flex mt-2') do |form| %>
    <%= form.collection_select :user_id, User.where.not(id: @group.user_ids), :id, :full_name, {}, class: 'custom-select form-select' %>
---
SELECT "users"."id" FROM "users" INNER JOIN "user_group_associations" ON "users"."id" = "user_group_associations"."user_id" WHERE "user_group_associations"."group_id" = ?  [["group_id", 6]]

  <ul class="list-group">
    <% @group.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "user_group_associations" ON "users"."id" = "user_group_associations"."user_id" WHERE "user_group_associations"."group_id" = ?  [["group_id", 6]]