app/views/groups/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
---
          <td><%= group.name %></td>
          <td><%= group.organizers.map { |ua| ua.user.full_name }.join(', ') %></td>