app/helpers/groups_helper.rb

SELECT "user_group_associations".* FROM "user_group_associations" WHERE "user_group_associations"."user_id" = ? AND "user_group_associations"."group_id" = ? LIMIT ?  [["user_id", 3], ["group_id", 3], ["LIMIT", 1]]
---
  def user_current_role_class(user, target_role)
    colors = { 'organizer' => 'success', 'presenter' => 'warning', 'participant' => 'primary' }
    user_association = user.user_group_associations.find_by(group: @group)