app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Test Group"], ["created_at", "2024-01-25 16:34:40.776847"], ["updated_at", "2024-01-25 16:34:40.776847"]]

  def update
    respond_to do |format|
      if @group.update(group_params)
---
UPDATE "groups" SET "name" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["name", "Marketings"], ["updated_at", "2024-01-24 19:03:24.125089"], ["id", 6]]

  def destroy
    if @group.destroy
---
DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 2]]

  def add_user_to_group
    user_id = params[:user_group_association][:user_id]

    if user_id.present? && !@group.user_ids.include?(user_id.to_i)
---
SELECT 1 AS one FROM "users" INNER JOIN "user_group_associations" ON "users"."id" = "user_group_associations"."user_id" WHERE "user_group_associations"."group_id" = ? AND "users"."id" = ? LIMIT ?  [["group_id", 1], ["id", 4], ["LIMIT", 1]]
SELECT 1 AS one FROM "user_group_associations" WHERE "user_group_associations"."user_id" = ? AND "user_group_associations"."group_id" = ? LIMIT ?  [["user_id", 11], ["group_id", 18], ["LIMIT", 1]]
SELECT "users"."id" FROM "users" INNER JOIN "user_group_associations" ON "users"."id" = "user_group_associations"."user_id" WHERE "user_group_associations"."group_id" = ?  [["group_id", 1]]

  def user(user_id)
    User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]