app/models/group.rb

  def update_user_role(user, role)
    user_group_association = user_group_associations.find_by(user:)
    if user_group_association
      user_group_association.update(role:)
---
UPDATE "user_group_associations" SET "role" = ?, "updated_at" = ? WHERE "user_group_associations"."id" = ?  [["role", "Organizer"], ["updated_at", "2024-01-25 16:27:38.649724"], ["id", 3]]